src/cf/Enums/ВидыАгентскихДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыАгентскихДоговоров</Name>
			<Comment>Виды договоров, согласно которым организация выступает в качестве налогового агента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
					<Comment>Договор аренды муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущества</Name>
					<Comment>Договор покупки государственного или муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
					<Comment>Договор с контрагентом (иностранной компанией) не являющимся плательщиком НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НерезидентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыАгентскихДоговоров/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

// Определяет порядок уплаты налога в зависимости от переданного вида агентского договора.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры:
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров - вид договора налогового агента, 
//                             для которого необходимо определить порядок уплаты.
// Возвращаемое значение:
//     Булево - Истина - если налог уплачивается сразу при начислении,
//              Ложь - если налог уплачивается по 1/3 в течение квартала, следующего за кварталом начисления.
Функция НалогУплачиваетсяПриНачислении(ВидАгентскогоДоговора) Экспорт
	
	Возврат ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент
	    ИЛИ ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги;
	
КонецФункции

// Определяет, относится ли переданный вид агентского договора договором с нерезидентом.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры:
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров - вид договора налогового агента, 
//                             для которого необходимо определить признак.
// Возвращаемое значение:
//     Булево - Истина - договор с нерезидентом,
//              Ложь - договор с резидентом.
Функция ЭтоНерезидент(ВидАгентскогоДоговора) Экспорт
	
	Возврат НалогУплачиваетсяПриНачислении(ВидАгентскогоДоговора);
	
КонецФункции

// Возвращает массив видов договоров налогового агента по которым требуется округление налога.
// Возвращаемое значение:
//     ВидыДоговоров - Массив - массив значений виды ПеречислениеСсылка.ВидыАгентскихДоговоров.
Функция МассивВидовДоговоровТребующихОкругленияНалога() Экспорт
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.Нерезидент);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.РеализацияИмущества);
	
	Возврат ВидыДоговоров;
	
КонецФункции

// Возвращает массив видов договоров налогового агента с нерезидентом.
// Возвращаемое значение:
//     ВидыДоговоров - Массив - массив значений виды ПеречислениеСсылка.ВидыАгентскихДоговоров.
Функция МассивВидовДоговоровСНерезидентом() Экспорт
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.Нерезидент);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги);
	
	Возврат ВидыДоговоров;
	
КонецФункции

#КонецОбласти

#КонецОбласти
